##为什么要学习写作
作为一个理工科，参加工作都快20年了，为什么还要学习写作呢?!
与诸君充满情怀的发心、浪漫的愿景不同，我练习写作的动机完全是功利化的，是基于效率的考量、源于商业的目的。
事情还得回到最近工作上的一件小事：我们的网站有了一次重大的改版，这次改版无论是在内容文字上、视觉设计上较过去都有重大的突破，
我们一改往日工科生的思维方式——信息陈列和逻辑展现，而采用了更加符合人类认知的故事讲述方式，也就是好莱坞长盛不衰的秘密——故事结构，等等。
我的本意就想将这些要点和经验总结下来，形成文字，以便同事共享、方便查用，慢慢积累形成我们自己的知识库。于是，就撸起袖子、自我陶醉的写了一篇文章。
说实话，我自己觉得表达的还是比较清楚的，最后抽象出来的理论有高度，对具体工作也有指导意义。发给同事和领导看。同事和领导同时告诉我，没-有-看-懂！
我沉思半响之后，得出一个重要结论：他们是对的！
不要笑，这个结论对我来说太重要了，以前的我只会归结为他们的问题：不是不认真、背景知识少就是智力不匹配。而这次，我选择了：是-我-写-的-有-问-题。
这是我报班跟阳老师学习写作的触发点。是的，在这个节骨眼儿上，打哈欠想睡觉，有人就伸手递了枕头，阳老师在群里说又开班了！所以我来了。
而且是带着功利的目的来的。


工作其实挺忙的，能下定决心来，还有一些小九九，我觉得写作的价值有点像铀元素的裂变反应：
第一，与自己沟通，通过写作可以让自己的想法更具条理、知识体系更加系统，写作时还能产生灵感，写作就像土壤一样不断生长出新的知识。
当知识体系一旦建立之后，价值观也就有了根基，不再人云亦云，浮萍人生；
第二，与他人沟通，好的文章可以提高沟通效率，迅速将自己的想法兜售给对方，兜售是沟通的关键词，这里稍微题外一句：
将自己的想法装到别人的脑袋里是商业沟通的唯一目标，不是想法的客观性、完整性、严谨性。
回到正题，高效的沟通，容易形成统一意见，建立共识，形成好的秩序。一篇好文章，就应该像核弹中铀元素的裂变反应，一击而中、层层加倍，
一方面引爆全局，一方面释放出来巨大的能量。

周六去现场聆听阳老师讲课，听到“最小”这个概念时，不禁拍案叫绝：这世间万事万物的道理竟有如此暗合之妙，文本中的最小模型、最小故事、最小行动，
竟然与软件代码世界中最小代码的思想暗合。最小代码这个概念是我现场临时冒出来的，大意是：在开源的代码世界，已经存在了上百万种代码，
他们是由最小代码构成的，每个最小代码代表了代码世界的最小知识，最小的逻辑结构，最小的信息结构，甚至是最小的运行单位。而一个优秀的程序员，
就是能够将这些开源代码中的各种最小代码了然于胸，随意组合，构建数字空间。以开发应用为例，程序员在了解需求之后，
就开始构思如何用自己的代码将已经存在的各种开源代码以及其中各种最小代码捏合起来，把他们组装成一个新的软体，来满足需求。

与诸君共勉！
